Repository: ic1998/Cor-En
Catalog: TMX_datasets/9_en_kw.tmx
Source language: en
Languages: kw

source: I hate Tom now.
kw: Kas yw genev Tom lemmyn.

source: You can't go there.
kw: Ny yll'ta mos ena.

source: She has red flowers.
kw: Yma dhedhy bleujyow rudh.

source: I hate milk.
kw: Kas yw genev leth.

source: You must work together.
kw: Res yw dhis oberi war-barth.

source: You must try this.
kw: Res yw dhis assaya hemma.

source: You must see this.
kw: Res yw dhis gweles hemma.

source: You must leave now.
kw: Res yw dhis diberth lemmyn.

source: You must come home.
kw: Res yw dhis dos tre.

source: We have to work together.
kw: Res yw dhyn oberi war-barth.

source: We must work now.
kw: Res yw dhyn oberi lemmyn.

source: We need to work now.
kw: Res yw dhyn oberi lemmyn.

source: We have to work now.
kw: Res yw dhyn oberi lemmyn.

source: We must talk.
kw: Res yw dhyn kewsel.

source: We must finish this.
kw: Res yw dhyn gorfenna hemma.

source: We have to finish this.
kw: Res yw dhyn gorfenna hemma.

source: We need to finish this.
kw: Res yw dhyn gorfenna hemma.

source: They are not coming.
kw: Nyns esons i ow tos.

source: We could talk now.
kw: Ni a allas kewsel lemmyn.

source: We need to talk more.
kw: Res yw dhyn kewsel moy.

source: Tom was speaking to Mary.
kw: Yth esa Tom ow kewsel orth Maria.

source: You'll have to stay in the garage.
kw: Res vydh dhis gortos y'n karrji.

source: I like butterflies.
kw: Da yw genev tykkies Duw.

source: The plants are growing.
kw: Yma’n losow ow tevi.

source: My dog is big.
kw: Bras yw ow hi.

source: I don't like cheese.
kw: Nyns yw da genev keus.

source: I slept.
kw: My a goskas.

source: We have to tell someone.
kw: Res yw dhyn leverel nebonan.

source: He was hungry.
kw: Yth esa nown dhodho.

source: The weather is very windy.
kw: Pur wynsek yw an gewer.

source: Tom didn't tell me he was married.
kw: Ny dherivis Tom orthiv y vos demedhys.

source: Has Tom told Mary that he's married?
kw: A leveris Tom dhe Varia y vos demedhys?

source: Do you see the man or the wolf?
kw: A welydh an den po an bleydh?

source: We don't have to do this.
kw: Nyns yw res dhyn gul hemma.

source: What will we eat?
kw: Pandr’a vynnyn dhe dhybri?

source: You can't sit there.
kw: Ny yll'ta esedha ena.

source: You liked chocolate.
kw: Da o genes choklet.

source: Why do you want to go today?
kw: Prag y fynn'ta mos hedhyw?

source: We will have to wait.
kw: Res vydh dhyn gortos.

source: You are thirsty.
kw: Yma seghes dhis.

source: You're thirsty.
kw: Yma seghes dhis.

source: Where is Cornwall?
kw: Ple’ma Kernow?

source: I like bread.
kw: Da yw genev bara.

source: The room is quite small.
kw: Byghan lowr yw an stevel.

source: Today is Tuesday.
kw: dy'Meurth yw hedhyw.

source: I need to go there.
kw: Res yw dhymm mos ena.

source: She left.
kw: Hi a dhibarthas.

source: Bring me another fork, please.
kw: Ro dhymm forgh aral, mar pleg.

source: He left.
kw: Ev a dhibarthas.

source: We must wash the floor.
kw: Res yw dhyn golghi an leur.

source: I have a headache this morning.
kw: Yma drog penn dhymm an myttin ma.

source: Tom has bought a new car.
kw: Tom re brenas carr-tan nowydh.

source: He had to go there.
kw: Res o dhodho mos ena.

source: He doesn't like eggs.
kw: Nyns yw da ganso oyow.

source: Do they like wine?
kw: Yw da gansa gwin?

source: She knows how to speak Spanish.
kw: Hi a wor kewsel Spaynek.

source: Toshio, who do you like?
kw: Toshio, piw yw da genes?

source: The couple are going out of the church.
kw: Yma’n dhewbries ow mos yn-mes a’n eglos.

source: That church stands on a hill.
kw: Yma’n eglos na war vre.

source: Tom didn't understand a thing.
kw: Ny gonvedhas Tom tra vyth.

source: She doesn't need money.
kw: Nyns eus edhom dhedhi a arghans.

source: She doesn't know.
kw: Ny wor.

source: I own a white and black dog.
kw: Yma dhymm ki gwynn ha du.

source: I can walk there on foot.
kw: My a yll kerdhes di war droos.

source: Can they see the picture?
kw: A yllons i gweles an lymnans?

source: Are there books in your house?
kw: Eus lyvrow y’th chi?

source: Continue your story.
kw: Pes dha hwedhel.

source: We have to try something.
kw: Res yw dhyn assaya neppyth.

source: The woman eats bread.
kw: An venyn a dheber bara.

source: Osaka is larger than Kyoto.
kw: Osaka yw brassa es Kyoto.

source: We eat.
kw: Ni a wre dybri.

source: "Do you want to buy them?" "Yes."
kw: “A vyn’ta aga frena?” “Mynnav.”

source: Speak with me.
kw: Kows genev.

source: I buy newspapers every day.
kw: My a bren paperyow-nowodhow pub dydh.

source: I'm catching a cold, I believe.
kw: Yth esov owth anwosi, dell grysav.

source: What's the meaning of this phrase?
kw: Pyth yw styr an lavar-ma?

source: Maria was standing.
kw: Yth esa Maria a’y sav.

source: My grandmother is very old.
kw: Pur goth yw ow mamm-wynn.

source: It rains.
kw: Glaw a wra.

source: When you smile, I am happy.
kw: Pan vinhwerthydh, lowen ov vy.

source: It may rain before long.
kw: Martesen y hwra glaw kyns pell.

source: It's the last train.
kw: An diwettha tren yw.

source: Tom lit the candle with the match.
kw: Tom a enowis an gantol gans an tanbren.

source: Was Tom very busy?
kw: O Tom pur vysi?

source: Who broke it?
kw: Piw a’n torras?

source: I was in hospital for a week.
kw: Yth esen vy yn klavji dres seythen.

source: And what did she draw in the sand?
kw: Ha pandr’a wrug hi dhe dhelinya y’n tewes?

source: He takes honey instead of sugar.
kw: Ev a gemmer mel yn le sugra.

source: This house isn't very big.
kw: Nyns yw pur vras an chi-ma.

source: What must you do?
kw: Pyth yw res dhis y wul?

source: I'm too small.
kw: Re vyghan ov.

source: I often eat apples.
kw: My a dheber avalow yn fenowgh.

source: I need to sleep now.
kw: Res yw dhymm koska lemmyn.

source: He can fly.
kw: Ev a yll neyja.

source: My children are sitting at the table.
kw: Yma ow fleghes a’ga esedh orth an voos.

source: I must sleep now.
kw: Res yw dhymm koska lemmyn.

source: They smoke.
kw: I a wre megi.

source: Where is the kitchen?
kw: Ple’ma’n gegin?

source: He's my dad.
kw: Ow thas yw ev.

source: I am reading his book.
kw: Yth esov ow redya y lyver.

source: I prefer to read.
kw: Gwell yw genev redya.

source: That is my brother.
kw: Henn yw ow broder.

source: I wasn't as strong as my father.
kw: Nyns en vy mar grev avel ow thas.

source: I don't drink their water.
kw: Ny evav aga dowr.

source: This meat is good.
kw: Da yw an kig-ma.

source: Tom washed himself.
kw: Tom a omwolghas.

source: Tom has washed himself.
kw: Tom re omwolghas.

source: I drink milk.
kw: My a yv leth.

source: Tom is not in hospital.
kw: Nyns usi Tom y’n klavji.

source: Tom's not in hospital.
kw: Nyns usi Tom y’n klavji.

source: He doesn't like to drink coffee.
kw: Nyns yw da ganso eva koffi.

source: Yes, there are two.
kw: Eus, yma dew.

source: We're trying to work.
kw: Yth eson ni owth assaya oberi.

source: We're trying to study here.
kw: Yth eson ni owth assaya studhya omma.

source: We have to try this.
kw: Res yw dhyn assaya hemma.

source: We have to do this.
kw: Res yw dhyn gul hemma.

source: We have to run now.
kw: Res yw dhyn ponya lemmyn.

source: We used to live together.
kw: Ni a wre kesvewa.

source: We used to work together.
kw: Ni a wre oberi war-barth.

source: We don't have to read that.
kw: Nyns yw res dhyn redya henna.

source: We had to leave quickly.
kw: Res o dhyn diberth yn uskis.

source: We used to live here.
kw: Ni a wre triga omma.

source: We could try again.
kw: Ni a allas assaya arta.

source: I had two dogs.
kw: Yth esa dew gi dhymm.

source: We have three dogs.
kw: Yma tri hi dhyn.

source: It's a big hospital.
kw: Klavji bras yw.

source: Tom has a big dog.
kw: Yma ki bras dhe Tom.

source: Those are too big.
kw: An re na yw re vras.

source: I like honey.
kw: Da yw genev mel.

source: They dream.
kw: I a hunrosas.

source: Must I stay home today?
kw: Yw res dhymm gortos tre hedhyw?

source: Tom speaks French well, I think.
kw: Tom a gews Frynkek yn ta, dell grysav.

source: I hate the sun.
kw: Kas yw genev an howl.

source: My mother loves me.
kw: Ow mamm a’m kar.

source: The book was new.
kw: Nowydh o an lyver.

source: You like girls.
kw: Da yw genes mowesi.

source: They don't want to come.
kw: Ny vynnons dos.

source: They don't come.
kw: Ny wrons dos.

source: They sing.
kw: I a gana.

source: They were singing.
kw: Yth esens ow kana.

source: It isn't empty.
kw: Nyns yw gwag.

source: You do not wash.
kw: Ny wre’ta omwolghi.

source: You can't do it.
kw: Ny yll'ta y wul.

source: What sort of book did you buy?
kw: Py par lyver a brensys?

source: I didn't see Tom.
kw: Ny welis Tomm.

source: I hate dogs.
kw: Kas yw genev keun.

source: You can't do that.
kw: Ny yll'ta gul henna.

source: You can't go now.
kw: Ny yll'ta mos lemmyn.

source: You can't sell it.
kw: Ny yll'ta y wertha.

source: I think you will be a great father.
kw: My a breder y fedhydh tas pur dha.

source: John, did you see the cat?
kw: A Yowann, a welsys ta an gath?

source: Do you need to do that now?
kw: Yw res dhis gul henna lemmyn?

source: I don't want to open the window.
kw: Ny vynnav ygeri an fenester.

source: I am singing.
kw: Yth esov ow kana.

source: I love them.
kw: My a’s kar.

source: She called her sister.
kw: Hi a gelwis hy whor.

source: You can't have that.
kw: Ny yll'ta kavos henna.

source: You can't know that.
kw: Ny yll'ta godhvos henna.

source: You need to lie down.
kw: Res yw dhis gorwedha.

source: I'll give him his book tomorrow.
kw: My a vynn ri dhodho y lyver a-vorow.

source: You can't leave here.
kw: Ny yll'ta diberth omma.

source: You can't do anything.
kw: Ny yll'ta gul tra vyth.

source: What colour is the cloud?
kw: Py liw yw an komolen?

source: The dog is red.
kw: Rudh yw an ki.

source: You'll have to leave now.
kw: Res vydh dhis diberth lemmyn.

source: You don't have to do it.
kw: Nyns yw res dhis y wul.

source: You'll have to come here.
kw: Res vydh dhis dos omma.

source: You don't need to do this.
kw: Nyns yw res dhis gul hemma.

source: You don't have to be here.
kw: Nyns yw res dhis bos omma.

source: You don't have to say that.
kw: Nyns yw res dhis leverel henna.

source: You'll have to come with us.
kw: Res vydh dhis dos genen.

source: You'll have to come with me.
kw: Res vydh dhis dos genev.

source: You don't need to know that.
kw: Nyns yw res dhis godhvos henna.

source: You don't have to go inside.
kw: Nyns yw res dhis mos a-ji.

source: You didn't have to come.
kw: Nyns o res dhis dos.

source: I am waiting.
kw: Yth esov vy ow kortos.

source: I have to be here.
kw: Res yw dhymm bos omma.

source: I need to win.
kw: Res yw dhymm gwaynya.

source: I remember this.
kw: Yma kov dhymm a hemma.

source: I had to leave.
kw: Res o dhymm diberth.

source: Do you need to work on Sundays?
kw: Yw res dhis oberi dy Sul?

source: I'm trying to do that.
kw: Yth esov vy owth assaya gul henna.

source: Why do I need to do this?
kw: Prag yth yw res dhymm gul hemma?

source: Do I have to do that?
kw: Yw res dhymm gul henna?

source: Go with them!
kw: Ke gansa!

source: Why do we need to do that?
kw: Prag yth yw res dhyn gul henna?

source: Why do you want to talk to Tom?
kw: Prag y fynn'ta kewsel orth Tom?

source: Why do we need to find Tom?
kw: Prag yth yw res dhyn kavos Tom?

source: I can't go there.
kw: Ny allav vy mos ena.

source: She likes to drink.
kw: Da yw gensi eva.

source: You don't need to go tomorrow.
kw: Nyns yw res dhis mos a-vorow.

source: What color are those?
kw: Py liw yw an re na?

source: Why do you need to do that now?
kw: Prag yth yw res dhis gul henna lemmyn?

source: Do you remember that?
kw: Eus kov dhis a henna?

source: They can come.
kw: I a yll dos.

source: You don't need to leave now.
kw: Nyns yw res dhis diberth lemmyn.

source: Oscar was my mom's dog.
kw: Ki ow mamm o Oscar.

source: Tom wrote that book.
kw: Tomm a skrifis an lyver na.

source: You don't have to help.
kw: Nyns yw res dhis gweres.

source: You'll have to wait here.
kw: Res vydh dhis gortos omma.

source: You like beans.
kw: Da yw genes fav.

source: I have to do it.
kw: Res yw dhymm y wul.

source: You like to swim.
kw: Da yw genes neuvya.

source: We like the snow.
kw: Da yw genen an ergh.

source: They had to go to the hospital.
kw: Res o dhedha mos dhe'n klavji.

source: Tom doesn't like the idea.
kw: Nyns yw da gans Tom an tybyans.

source: I am hungry
kw: Yma nown dhymm.

source: I want these.
kw: My a vynn an re ma.

source: I hate that color.
kw: Kas yw genev an liw na.

source: I like to speak Welsh.
kw: Da yw genev kewsel Kembrek.

source: I like coffee.
kw: Da yw genev koffi.

source: Have you got a headache?
kw: Eus drog penn dhis?

source: The weather was rainy.
kw: Glawek o an gewer.

source: He has a white dog.
kw: Yma ki gwynn dhodho.

source: This idea is controversial.
kw: Gorthargyadow yw an tybyans ma.

source: She folded the quilt.
kw: Hi a blegyas an golghes.

source: I'm trying to work.
kw: Yth esov vy owth assaya oberi.

source: I can't go yet.
kw: Ny allav vy mos hwath.

source: Do I have to do this now?
kw: Yw res dhymm gul hemma lemmyn?

source: I prepared breakfast for him.
kw: My a bareusis hansel ragdho.

source: I hate her hat.
kw: Kas yw genev hy hatt.

source: I hate his hat.
kw: Kas yw genev y hatt.

source: I prepared breakfast for you.
kw: My a bareusis hansel ragos.

source: I prepared breakfast for her.
kw: My a bareusis hansel rygdhi.

source: I prepared breakfast for them.
kw: My a bareusis hansel ragdha.

source: I don't need to do that.
kw: Nyns yw res dhymm gul henna.

source: Where are your children?
kw: Ple'ma agas fleghes?

source: Is this his umbrella?
kw: Yw homma y lawlen?

source: Is this her umbrella?
kw: Yw homma hy glawlen?

source: Is that her umbrella?
kw: Yw honna hy glawlen?

source: Is that his umbrella?
kw: Yw honna y lawlen?

source: He must clean his room.
kw: Res yw dhodho glanhe y stevel.

source: I hate the rain.
kw: Kas yw genev an glaw.

source: Why can't I see you?
kw: Prag na allav dha weles?

source: I have been speaking Spanish.
kw: My re bia ow kewsel Spaynek.

source: Where is his dog?
kw: Ple'ma y gi?

source: Where is her dog?
kw: Ple'ma hy hi?

source: I like black.
kw: Da yw genev du.

source: There are islands in the sea.
kw: Yma enesow y’n mor.

source: You have seven children.
kw: Yma seyth flogh dhis.

source: He is trying to sing.
kw: Yma ev owth assaya kana.

source: She wanted to buy the book.
kw: Hi a vynnas prena an lyver.

source: I will not come.
kw: Ny vynnav dos.

source: You don't have to try.
kw: Nyns yw res dhis assaya.

source: I like clothes.
kw: Da yw genev dillas.

source: I need to come home.
kw: Res yw dhymm dos tre.

source: I must be there.
kw: Res yw dhymm bos ena.

source: I had to know more.
kw: Res o dhymm godhvos moy.

source: I had to say something.
kw: Res o dhymm leverel neppyth.

source: I needed to hear that.
kw: Res o dhymm klewes henna.

source: Do I have to undress?
kw: Yw res dhymm diwiska?

source: I hate that sound.
kw: Kas yw genev an tros na.

source: We had to walk home.
kw: Res o dhyn kerdhes tre.

source: I like to come here.
kw: Da yw genev dos omma.

source: Tom doesn't like milk.
kw: Nyns yw da gans Tom leth.

source: I want to travel.
kw: My a vynn viajya.

source: I still need to talk to Tom.
kw: Res yw dhymm hwath kewsel orth Tom.

source: We had to help Tom.
kw: Res o dhyn gweres Tom.

source: I like dogs, too.
kw: Da yw genev keun, ynwedh.

source: They're trying to help.
kw: Yth esons i owth assaya gweres.

source: Tom had three dogs.
kw: Yth esa tri hi dhe Tom.

source: I don't need to know this.
kw: Nyns yw res dhymm godhvos hemma.

source: We don't need to leave yet.
kw: Nyns yw res dhyn diberth hwath.

source: I must leave on Monday.
kw: Res yw dhymm diberth dy Lun.

source: I still need to buy food for the party.
kw: Res yw dhymm hwath prena boos rag an kevewi.

source: What's that dog doing?
kw: Pyth yw an ki na ow kul?

source: Why do you need to go?
kw: Prag yth yw res dhis mos?

source: Why do you need to do this?
kw: Prag yth yw res dhis gul hemma?

source: Why do I need to do that?
kw: Prag yth yw res dhymm gul henna?

source: What kind of dog is it?
kw: Py par ki yw?

source: Do we have to go now?
kw: Yw res dhyn mos lemmyn?

source: They ran.
kw: I a bonyas.

source: You're hungry.
kw: Yma nown dhis.

source: She prepared lunch.
kw: Hi a bareusis li.

source: You have seven sons.
kw: Yma seyth mab dhis.

source: Do I have to go with you?
kw: Yw res dhymm mos genes?

source: Do you like women?
kw: Yw da genes benenes?

source: Why do you want to work for us?
kw: Prag y fynn'ta oberi ragon?

source: Is the exam today?
kw: Yw an apposyans hedhyw?

source: Do you have to work today?
kw: Yw res dhis oberi hedhyw?

source: I have to work today.
kw: Res yw dhymm oberi a-vorow.

source: I hate those things.
kw: Kas yw genev an traow na.

source: Do you like these?
kw: Yw da genes an re ma?

source: Why do you need to do that?
kw: Prag yth yw res dhis gul henna?

source: I can't remember that.
kw: Ny allav vy perthi kov henna.

source: I've been trying to do that.
kw: My re bia owth assaya gul henna.

source: I had to do that.
kw: Res o dhymm gul henna.

source: I was studying.
kw: Yth esen vy ow studhya.

source: We need to start.
kw: Res yw dhyn dalleth.

source: Do I have to answer that question?
kw: Yw res dhymm gorthebi an govyn?

source: Where are your parents?
kw: Ple’ma dha gerens?

source: I have to buy one.
kw: Res yw dhymm prena onan.

source: Do I need to go now?
kw: Yw res dhymm mos lemmyn?

source: I have to study now.
kw: Res yw dhymm studhya lemmyn.

source: I need to go now.
kw: Res yw dhymm mos lemmyn.

source: Do I have to do anything more?
kw: Yw res dhymm gul neppyth moy?

source: Do I have to come on Monday?
kw: Yw res dhymm dos dy Lun?

source: I like milk.
kw: Da yw genev leth.

source: Was that a lie?
kw: O henna gow?

source: You need to know.
kw: Res yw dhis godhvos.

source: Do they have to do it?
kw: Yw res dhedha y wul?

source: We have to do it.
kw: Res yw dhyn y wul.

source: I'm trying to improve.
kw: Yth esov vy owth assaya gwellhe.

source: Do I need to hurry?
kw: Yw res dhymm fistena?

source: I like to fish.
kw: Da yw genev pyskessa.

source: We must leave this evening.
kw: Res yw dhyn diberth an gorthugher ma.

source: I don't want to eat.
kw: Ny vynnav vy dybri.

source: Do you need to lie down?
kw: Yw res dhis gorwedha?

source: I want this dog.
kw: My a vynn kavos an ki ma.

source: Tom has a white dog.
kw: Yma ki gwynn dhe Tom.

source: Tom wanted to buy a dog.
kw: Tom a vynnas prena ki.

source: I don't want a dog.
kw: Ny vynnav vy kavos ki.

source: The exam was difficult.
kw: Kales o an apposyans.

source: I was cleaning.
kw: Yth esen vy ow klanhe.

source: I can't eat chocolate.
kw: Ny allav vy dybri choklet.

source: Do you like cheese?
kw: Yw da genes keus?

source: I hate that cat.
kw: Kas yw genev an gath na.

source: Do I have to do anything?
kw: Yw res dhymm gul neppyth?

source: Tom doesn't like to wait.
kw: Nyns yw da gans Tom gortos.

source: Go with me.
kw: Ke genev.

source: I speak five languages.
kw: My a gews pymp yeth.

source: He wants a new dog.
kw: Ev a vynn ki nowydh.

source: She wants a new dog.
kw: Hi a vynn ki nowydh.

source: I want a new dog.
kw: My a vynn ki nowydh.

source: Alas!
kw: Soweth!

source: This is our living room.
kw: Homm yw agan esedhva.

source: I used to work with them.
kw: My a wre oberi gansa.

source: I used to work with him.
kw: My a wre oberi ganso.

source: I used to work with her.
kw: My a wre oberi gensi.

source: I've been shopping with them.
kw: My re bia ow prenassa gansa.

source: I've been shopping with him.
kw: My re bia ow prenassa ganso.

source: I've been shopping with her.
kw: My re bia ow prenassa gensi.

source: I used to live with them.
kw: My a wre triga gansa.

source: I used to live with him.
kw: My a wre triga ganso.

source: I used to live with her.
kw: My a wre triga gensi.

source: Go with them.
kw: Ke gansa.

source: Go with him.
kw: Ke ganso.

source: Go with her.
kw: Ke gensi.

source: Do I have to eat with you?
kw: Yw res dhymm dybri genes?

source: Do I have to eat with them?
kw: Yw res dhymm dybri gansa?

source: Do I have to eat with him?
kw: Yw res dhymm dybri ganso?

source: Do I have to eat with her?
kw: Yw res dhymm dybri gensi?

source: Write to them.
kw: Skrif dhedha.

source: Write to him.
kw: Skrif dhodho.

source: Write to her.
kw: Skrif dhedhi.

source: Talk to them.
kw: Kows dhedha.

source: Talk to him.
kw: Kows dhodho.

source: Talk to her.
kw: Kows dhedhi.

source: I still need to talk to them.
kw: Res yw dhymm hwath kewsel orta.

source: I still need to talk to him.
kw: Res yw dhymm hwath kewsel orto.

source: I still need to talk to her.
kw: Res yw dhymm hwath kewsel orti.

source: Listen to them.
kw: Goslow orta.

source: Listen to him.
kw: Goslow orto.

source: Listen to her.
kw: Goslow orti.

source: You need to listen to them.
kw: Res yw dhis goslowes orta.

source: You need to listen to him.
kw: Res yw dhis goslowes orto.

source: You need to listen to her.
kw: Res yw dhis goslowes orti.

source: You have to listen to us.
kw: Res yw dhis goslowes orthyn.

source: You have to listen to them.
kw: Res yw dhis goslowes orta.

source: You have to listen to him.
kw: Res yw dhis goslowes orto.

source: You have to listen to her.
kw: Res yw dhis goslowes orti.

source: I can't see them.
kw: Ny allav aga gweles.

source: We used to work for them.
kw: Ni a wre oberi ragdha.

source: I used to work for them.
kw: My a wre oberi ragdha.

source: I used to work for him.
kw: My a wre oberi ragdho.

source: I used to work for her.
kw: My a wre oberi rygdhi.

source: I've been waiting for them.
kw: My re bia ow kortos ragdha.

source: I've been waiting for him.
kw: My re bia ow kortos ragdho.

source: I've been waiting for her.
kw: My re bia ow kortos rygdhi.

source: Do we need to wait for you?
kw: Yw res dhyn gortos ragos?

source: Do we need to wait for them?
kw: Yw res dhyn gortos ragdha?

source: I had to go to work.
kw: Res o dhymm mos dhe'n ober.

source: Tom doesn't like fish.
kw: Nyns yw da gans Tom pysk.

source: Tom doesn't like eggs.
kw: Nyns yw da gans Tom oyow.

source: I like to listen to good music.
kw: Da yw genev goslowes orth ilow dha.

source: My brother has a dog.
kw: Yma ki dhe ow vroder.

source: This is not my cat.
kw: Nyns yw homma ow hath vy.

source: I have a boyfriend.
kw: Yma karer dhymm.

source: Do you like wine?
kw: Yw da genes gwin?

source: Tom is walking his dog.
kw: Yma Tom ow kerdhes y gi.

source: The dog is black.
kw: Du yw an ki.

source: I don't want to dance.
kw: Ny vynnav vy donsya.

source: "Tom, say to me, please ..." - "Please!"
kw: “Tomm, lavar dhymm, mar pleg …” – “Mar pleg!”

source: I don't hate school.
kw: Nyns yw kas genev skol.

source: Are you drinking wine?
kw: Esos owth eva gwin?

source: She has forgotten her umbrella in a bus.
kw: Hi re ankovas hy glawlen yn kyttrin.

source: Where will Tom be?
kw: Ple fydh Tomm?

source: There isn't an orange on the table.
kw: Nyns eus owraval war an voos.

source: I can speak five languages.
kw: My a wor kewsel pymp yeth.

source: What's the weather like outside?
kw: Fatel yw an gewer yn-mes?

source: Where was the meeting?
kw: Ple'th esa an kuntelles?

source: Do we need to do this again?
kw: Yw res dhyn gul hemma arta?

source: Those are hounds.
kw: An re na yw helgi.

source: We don't need to hurry.
kw: Nyns yw res dhyn fistena.

source: I don't like beer.
kw: Nyns yw da genev korev.

source: I don't like cats.
kw: Nyns yw da genev kathes.

source: I have four children.
kw: Yma peswar flogh dhymm.

source: I must work tonight.
kw: Res yw dhymm oberi haneth.

source: I like the sun.
kw: Da yw genev an howl.

source: We used to go fishing together.
kw: Ni a wre mos pyskessa war-barth.
